Read and print the first 5 and the last 5 lines of a dataframe

In [1]:
import pandas as pd
import numpy as np

In [2]:
from google.colab import drive

In [3]:
drive.mount('/content/drive')

Mounted at /content/drive

In [4]:
path = "/content/drive/MyDrive/csv Files/company_sales_data.csv"
df=pd.read_csv(path)

In [5]:
df.head()

   month_number  facecream  facewash  ...  moisturizer  total_units  total_profit
0             1       2500      1500  ...         1500        21100        211000
1             2       2630      1200  ...         1200        18330        183300
2             3       2140      1340  ...         1340        22470        224700
3             4       3400      1130  ...         1130        22270        222700
4             5       3600      1740  ...         1740        20960        209600

[5 rows x 9 columns]

In [6]:
df.tail()

    month_number  facecream  facewash  ...  moisturizer  total_units  total_profit
7              8       3700      1400  ...         1400        36140        361400
8              9       3540      1780  ...         1780        23400        234000
9             10       1990      1890  ...         1890        26670        266700
10            11       2340      2100  ...         2100        41280        412800
11            12       2900      1760  ...         1760        30020        300200

[5 rows x 9 columns]